In [91]:
import pandas as pd

purchase_1 = pd.Series({'Name': 'Alan',
                       'Item purchased': 'Dog food',
                       'Cost': 1.00})
print(purchase_1)

purchase_2 = pd.Series({'Name': 'Betty',
                       'Item purchased': 'Cat food',
                       'Cost': 2.00})

purchase_3 = pd.Series({'Name': 'Chris',
                       'Item purchased': 'Bird food',
                       'Cost': 3.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3],
                  index = ['Store1', 'Store1', 'Store3'])
df

Name                  Alan
Item purchased    Dog food
Cost                     1
dtype: object

         Name Item purchased  Cost
Store1   Alan       Dog food   1.0
Store1  Betty       Cat food   2.0
Store3  Chris      Bird food   3.0

In [11]:
df.loc['Store3']

Name                  Chris
Item purchased    Bird food
Cost                      3
Name: Store3, dtype: object

In [12]:
type(df.loc['Store3'])

pandas.core.series.Series

In [13]:
# SELECT rows 
df.loc['Store1']

         Name Item purchased  Cost
Store1   Alan       Dog food   1.0
Store1  Betty       Cat food   2.0

In [19]:
df.loc['Store1','Name']

Store1     Alan
Store1    Betty
Name: Name, dtype: object

In [20]:
df.loc['Store1']['Name']

Store1     Alan
Store1    Betty
Name: Name, dtype: object

In [23]:
df.T

                  Store1    Store1     Store3
Name                Alan     Betty      Chris
Item purchased  Dog food  Cat food  Bird food
Cost                   1         2          3

In [30]:
df.T.loc['Name']

Store1     Alan
Store1    Betty
Store3    Chris
Name: Name, dtype: object

In [29]:
# SELECT a column
df['Name']

Store1     Alan
Store1    Betty
Store3    Chris
Name: Name, dtype: object

In [31]:
df

         Name Item purchased  Cost
Store1   Alan       Dog food   1.0
Store1  Betty       Cat food   2.0
Store3  Chris      Bird food   3.0

In [32]:
# SELECT a column
df.Name

Store1     Alan
Store1    Betty
Store3    Chris
Name: Name, dtype: object

In [35]:
df.Cost

Store1    1.0
Store1    2.0
Store3    3.0
Name: Cost, dtype: float64

In [36]:
# SELECT a row
df.loc['Store3']

Name                  Chris
Item purchased    Bird food
Cost                      3
Name: Store3, dtype: object

In [38]:
# SELECT a value
df.loc['Store3']['Name']

'Chris'

In [40]:
# Slicing
df.loc[:,['Name', 'Cost']]

         Name  Cost
Store1   Alan   1.0
Store1  Betty   2.0
Store3  Chris   3.0

In [52]:
# drop: row
# drop will return a copy of dropped origin (not change the origin)
df.drop('Store3')

         Name Item purchased  Cost
Store1   Alan       Dog food   1.0
Store1  Betty       Cat food   2.0

In [53]:
df

         Name Item purchased  Cost
Store1   Alan       Dog food   1.0
Store1  Betty       Cat food   2.0
Store3  Chris      Bird food   3.0

In [54]:
copy_df = df.copy()
copy_df = copy_df.drop('Store3')
copy_df

         Name Item purchased  Cost
Store1   Alan       Dog food   1.0
Store1  Betty       Cat food   2.0

In [57]:
# del a column
# del will change the origin
del copy_df['Name']
copy_df

       Item purchased  Cost
Store1       Dog food   1.0
Store1       Cat food   2.0

In [97]:
# add a column
df['Location']= None
df

         Name Item purchased  Cost Location
Store1   Alan       Dog food   1.0     None
Store1  Betty       Cat food   2.0     None
Store3  Chris      Bird food   3.0     None

In [118]:
df.columns

Index(['Name', 'Item purchased', 'Cost', 'Location'], dtype='object')

In [112]:
df

         Name Item purchased  Cost Location
Store1   Alan       Dog food   1.0     None
Store1  Betty       Cat food   2.0     None
Store3  Chris      Bird food   3.0     None

In [117]:
# add rows: append
customers = [('David', 'Human food', 4.0, 'UK'),
             ('Evid', 'Wolf food', 5.0, 'USA')]
s = pd.DataFrame(customers,
                 columns=df.columns,
                 index=['Store4', 'Store5'])
print(s)

# append returns a copy
df_added = df.append(s)
df_added

         Name Item purchased  Cost Location
Store4  David     Human food   4.0       UK
Store5   Evid      Wolf food   5.0      USA

         Name Item purchased  Cost Location
Store1   Alan       Dog food   1.0     None
Store1  Betty       Cat food   2.0     None
Store3  Chris      Bird food   3.0     None
Store4  David     Human food   4.0       UK
Store5   Evid      Wolf food   5.0      USA